[
  {
    "id": "mf_atlas",
    "source": "SSC",
    "name": "ATLAS",
    "mechtype": [
      "Striker"
    ],
    "y_pos": 14,
    "description": "Originally commissioned and tested as a dueling mech for the House of Smoke, the ATLAS blurs the line between mechanized chassis and powered personal armor. The result of a long project in SSC’s Exotic Materials group, the Atlas was able to utilize the bleeding edge of reactor miniaturization tech to produce a chassis resembling a large, sleek hard suit, almost skin-tight at points. Though sacrificing much of the durability of a larger frame, the mech’s essential systems are so closely melded with its user’s movements that it offers unparalleled maneuverability.<br>Though originally licensed for only select clientele, SSC allowed a small amount of Atlas chassis to be introduced to select Sparri mercenary groups after the pattern’s design was leaked by ExoMat personnel who accidentally lost a suit to a Sparri Espada in a hotly contested game of Kapkat. Following its limited release, demand from Sparri groups grew so vocal that SSC was forced to reconsider its licensing scheme; considered perfect warrior frames for hunting the native megafauna of Sparr, they are now widely perceived as the iconic frames of Sparri headhunters and daredevils across the Orion Arm, to the point that the Sparri invented a new martial art using the Atlas.<br>Considered heirlooms of great warriors, Atlas frames among the Sparri are tied to family — blood and chosen — and maintained by hand. Each suit on Sparr bears the history of its previous pilots, from the decorations and modifications, to the systemic: the suit’s powerful internal databanks remember the unique movements of all that have worn it before, enabling Sparri hunters to literally call upon their ancestors in battle.",
    "mounts": [
      "Flex",
      "Main"
    ],
    "stats": {
      "size": 0.5,
      "armor": 0,
      "hp": 6,
      "evasion": 12,
      "edef": 6,
      "heatcap": 4,
      "repcap": 2,
      "sensor_range": 3,
      "tech_attack": -2,
      "save": 10,
      "speed": 6,
      "sp": 5
    },
    "traits": [
      {
        "name": "Giantkiller",
        "description": "The Atlas counts as size 1 for the purposes of ramming and grappling. It ignores engagement from actors larger than itself, can share space with larger actors (even hostile ones) and move through their spaces unimpeded. While sharing space with any character, it gains soft cover, even from that character."
      },
      {
        "name": "Jäger Dodge",
        "description": "1/round, when the Atlas takes damage from a character larger than itself, as a reaction it can gain resistance to that damage and move 3 spaces in any direction, ignoring engagement and reactions."
      },
      {
        "name": "Finishing Blow",
        "description": "1/round, the Atlas can deal +1d6 bonus damage with a successful melee attack against a prone target."
      },
      {
        "name": "Exposed Reactor",
        "description": "The Atlas takes +1 difficulty on all engineering checks and saves."
      }
    ],
    "core_system": {
      "name": "BLOODLINE active assist",
      "description": "The ATLAS extends microneedles into your musculature and ancillary nervous system, melding flesh, machine, and the memory of all who wore it before you.",
      "active_name": "Final Hunt",
      "active_effect": "When you take this action, until the end of the current scene gain the following effects:<li>The Atlas's movement from any source (moves, boosts, movement from systems or talents) increases by 1.<li>It always benefits from soft cover, no matter where it is.<li>The Atlas can hide even in the open, without requiring cover (the only way to reveal it is for an actor to search for it or it if breaks hiding the normal way - by boosting, attacking, forcing a save, or taking other actions that break hiding).<li>1/round, when the Atlas makes an attack from hiding, before the attack is rolled, its target must also pass a hull save or be knocked prone.",
      "tags": [
        {
          "id": "tg_quick_action"
        }
      ]
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://i.imgur.com/MWb5XtS.png"
  },
  {
    "id": "mf_caliban",
    "source": "IPS-N",
    "name": "CALIBAN",
    "mechtype": [
      "Striker",
      "Controller"
    ],
    "y_pos": 12.5,
    "description": "The Caliban is a relative newcomer in Interplanetary-Northstar’s line of single-client, chassis, already garnering a reputation among Trunk Security for its efficacy inside of the envelope for which it was designed; unlike many of IPS-N’s modern chassis, the Caliban has no civilian analog or antecedent; it was designed from the ground up to be a military machine.<br>The Caliban is IPS-N’s solution to the Yemanova Problem, or, the Impact-Override Problem. Capital ships, the problem notes, are incredibly expensive and time consuming for corpros and diasporan states to produce and maintain, and anti-ship weaponry has far outstripped capital defenses. In a conventional capital duel, a successful kill means the death of thousands of personnel and the loss of millions of units of manna; this leads many commanders to be gun-shy, relying on subline and fighter-class vessels to accomplish battle objectives rather than risk their big ships — a strategy that proves just as costly on average; instead of one or a handful of large ships being destroyed and signifying the end of a battle, engagements grind on for weeks as squadrons of smaller ships engage inside the unpredictability gap, inching towards victory.<br>IPS-N was the first to crack the Yemanova Problem. Their designers identified the need for a rapidly deployable, sub-signature, directed weapon or weapon system; well armed and armored, small enough to enter a ship and efficiently neutralize personnel in order to achieve victory. IPS-N created the Caliban to solve this mission need.<br>The mechanized chassis, cultural critics argue, venerates a particular humanity’s form, and is an unconscious nod towards the anthrochauvinist roots of the machine among leading chassis designers and fabricators. The Caliban is not that. It was never intended to be an image of man writ large, striding across the battlefield heroically to affect a greater purpose.<br>The Caliban has no roots, as many IPS-N chassis do, in the early efforts of freighter crews and asteroid miners to defend themselves. It was not born from ingenuity - there is no legacy of resilience, heroism, and the frontier spirit to paper over the purpose of its birth. It has no civilian applications in aid, disaster relief, construction, or farming.<br>It does not build, defend, or inspire. It was designed to solve a numbers problem on a ledger. It was only made small so it could to fit through most ship doors and bulkheads with minimal problems, crawl up the spinal corridors of ships, and speed up it’s average job completion rate by five minutes.<br>It is a tool designed to kill human beings very, very quickly.",
    "mounts": [
      "Heavy"
    ],
    "stats": {
      "size": 0.5,
      "armor": 2,
      "hp": 6,
      "evasion": 8,
      "edef": 8,
      "heatcap": 5,
      "repcap": 5,
      "sensor_range": 3,
      "tech_attack": -2,
      "save": 11,
      "speed": 3,
      "sp": 5
    },
    "traits": [
      {
        "name": "Wrecking Ball",
        "description": "The Caliban counts as size 3 when inflicting knock back from any ranged or melee attack."
      },
      {
        "name": "Pursue Prey",
        "description": "When the Caliban inflicts knock-back as part of any action, it can move the same number of spaces afterwards as a free action or reaction, as long as it moves towards its target by the most direct route possible. This movement ignores engagement and doesn’t provoke reactions."
      },
      {
        "name": "Slam",
        "description": "1/round when the Caliban knocks a character into a wall, mech, or other obstruction that would cause it to stop moving, it can cause its target to pass a hull save or take 1d6 kinetic damage and become impaired until the end of its next turn."
      },
      {
        "name": "Weak computer",
        "description": "The Caliban takes +1 difficulty on all systems saves and checks"
      }
    ],
    "core_system": {
      "name": "Flayer Shotgun",
      "description": "The Heavy Howitzer-Shotgun is a compact, formalized version of the long-popular “Daisy Cutter” pattern howitzer-shotgun used by Trunk Security and other stellar marine security forces. Chambered to accept 75mm shot, shells, and sabots, the “Flayer” shotgun sacrifices some of the raw power of the DC in favor of control and a much-improved fire rate.",
      "active_name": "Equip Autochoke",
      "active_effect": "The Flayer shotgun comes pre-equipped with a muzzle-mounted auto-choke, which allows its user to better define the spread of shot issuing from the weapon. The extreme heat from equipping the choke renders it unusable in short order and it must be discarded.<br>For the rest of this scene, the flayer shotgun gains the following profile:<br>Main CQB, Accurate, Knockback 5<br>[Cone 3][threat 3][1d6+2 kinetic damage]",
      "tags": [
        {
          "id": "tg_protocol"
        }
      ],
      "integrated": {
        "id": "mw_caliban_integrated"
      }
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://i.imgur.com/111stQO.png"
  },
  {
    "id": "mf_kobold",
    "source": "HORUS",
    "name": "KOBOLD",
    "mechtype": [
      "Controller"
    ],
    "y_pos": 25,
    "description": "The Kobold pattern group made its first appearance among Ungrateful partisans serving the House of Dust, a clever suite of hardware and software compatible with a broad portfolio of mining and heavy industry mechs. The steaming, shuddering final result of K-PG exposure is an ugly affair, transformed from plow to blade by a powerful, viral-morph liturgicode that makes it all but impossible for conventional codec sniffers to capture pre-print.<br>The Kobold’s clandestine transmission and application makes it the perfect machine to fight Barony suppression forces. The desperate workers who printed the first Kobolds found the pattern group to be eminently fungible: loaded into their mining exos and chassis, the K-PG repurposed reactors and industrial tools to deadly effect, weaponizing the very materials and superstructures that powered it; the rapid process of flash-melting, processing, and extruding raw material into molten plural-state particles is dangerous — often as dangerous to its pilot as it can be to its target.<br>Danger of operation notwithstanding, the Ungratefuls who first adopted the K-PG stunned their Baronic overseers with a series of rapid, total victories, liberating a great swath of the House of Dust’s lunar helium-3 mines. While eventually contained to Bo’s moon, the Ungrateful insurgency is ongoing, necessitating the deployment of H.Dust’s Graveborn Banner Company for counter-insurgency operations beyond the capability of local security forces.",
    "mounts": [
      "Main/Aux"
    ],
    "stats": {
      "size": 0.5,
      "armor": 1,
      "hp": 6,
      "evasion": 10,
      "edef": 10,
      "heatcap": 6,
      "repcap": 2,
      "sensor_range": 8,
      "tech_attack": 1,
      "save": 11,
      "speed": 4,
      "sp": 8
    },
    "traits": [
      {
        "name": "Mimic Carapace",
        "description": "If the KOBOLD starts its turn adjacent to a piece of terrain or hard cover size 1 or larger it becomes invisible while it remains adjacent to that terrain or cover. This invisibility breaks if it attacks or takes damage."
      },
      {
        "name": "Slag Spray",
        "description": "1/round as a quick action, the KOBOLD can create a size 1 piece of terrain (10 HP, evasion 5) within a free space within range 3 and line of sight. The semi-molten polymer grants hard cover."
      },
      {
        "name": "Exposed Reactor",
        "description": "The KOBOLD gets +1 difficulty on engineering checks and saves."
      }
    ],
    "core_system": {
      "name": "Terraform",
      "description": "Screeching and venting steam, the KOBOLD digs into the earth. In moments, the very ground bends to the pilot’s will, and the air itself shrieks with agony — the cry of every dead Ungrateful, martyred or taken by the Dustmen.",
      "active_name": "Terraform",
      "active_effect": "The Kobold extrudes a massive amount of polymer and creates up to 10 size 1 cubes of terrain within free, open spaces within range 5 of it. These cubes can be separate or connected, and stacked up to 5 spaces high. If connected, they form a contiguous surface and can potentially block line of sight. They grant soft cover the turn they are extruded, each section is independently destructible, has evasion 5, and 10 HP. At the start of the Kobold’s next turn, they harden into hard cover and each size 1 section gains +10 HP (it keeps any damage it still had).",
      "tags": [
        {
          "id": "tg_full_action"
        }
      ]
    },
    "data_type": "frame",
    "aptitude": {}
  },
  {
    "id": "mf_lich",
    "source": "HORUS",
    "name": "LICH",
    "mechtype": [
      "Support"
    ],
    "y_pos": 8,
    "description": ">//TRANSCRIPT: M.A2_Recovered[UIB:::TERMAGANT]<br>>//TANGENT ROYAL CLEARANCE<br>>//checking…<br>>//TRC_ACCEPTED. OPEN DOC:::Y<br>>//BEGIN:::<br>CALIGULA: So what is it?<br>DOGFRIEND_68: i wish i could tell you, man, it just showed up on the terminal. whole thing in one ping — it’s like a fucking K or two EXB. tried to autofab but i shut it down jic<br>CALIGULA: Gotta be a joke from Ash — she’s trying to wavedown our rig again, don’t let it print.<br>DOGFRIEND_68: fuck no<br>DOGFRIEND_68: do u think i have a death wish<br>CALIGULA: Yes.<br>CALIGULA: Well, who’s it from? Who’s the author?<br>CALIGULA: Hello?<br>CALIGULA: [waiting.omif]<br>DOGFRIEND_68: uh<br>CALIGULA: Who?<br>DOGFRIEND_68: us<br>CALIGULA: Us what?<br>DOGFRIEND_68: it’s from our terminal — we made it<br>CALIGULA: Pretty sure I’d remember if I wrote 1-2k exabyte fabrication by myself.<br>DOGFRIEND_68: yeah except thats our code man, the hash lines up beaucop-sigma<br>DOGFRIEND_68: ok also BigMama is telling me we didn’t actaully get anything inbound which means its just been local but thats impossible, we don’t have that much storage<br>CALIGULA: Let me see the file<br>CALIGULA: It’s dated 15005U<br>DOGFRIEND_68: [lolfuk.omif]<br>CALIGULA: There’s an audio track buried in here. Should I play it?<br>DOGFRIEND_68: i wanna say no but fuck it i’m curious<br>>//TRANSCRIPT ENDS",
    "mounts": [
      "Main/Aux"
    ],
    "stats": {
      "size": 1,
      "armor": 0,
      "hp": 4,
      "evasion": 8,
      "edef": 12,
      "heatcap": 3,
      "repcap": 5,
      "sensor_range": 15,
      "tech_attack": 1,
      "save": 11,
      "speed": 5,
      "sp": 8
    },
    "traits": [
      {
        "name": "Soul Vessel",
        "description": "At the start of the Lich’s turn, set down a marker at it’s current location (any marker created this way replaces previous markers). Once per round, as a reaction to being hit by an attack, failing a saving throw or check, or taking damage or heat from any source (even self), the Lich can immediately become completely immune to all the damage, heat, or conditions from that effect. It then resets its position to the marker or as close as possible, counting as teleporting. The Lich can also take this reaction at the end of any turn, including its own, but if taken this way it merely resets its position. It can’t take this reaction if jammed, stunned, grappled, or unable to take reactions from some other means."
      },
      {
        "name": "Immortal",
        "description": "1/scene, If the Lich is destroyed, in the round after it is destroyed, as a reaction to the end of any turn, it immediately returns to the location of its soul vessel, counting as teleporting, heals to full HP, clears all heat, and goes to 1 structure and stress (even if it had more remaining when it was destroyed). It may takes this reaction even though it’s destroyed, and can only take this reaction once per scene. If its pilot is dead and died the same scene, they also return to life. If it chooses not to make this reaction in that round, it remains destroyed and the pilot remains dead."
      }
    ],
    "core_system": {
      "name": "Chronostutter",
      "description": "“Drink Deep, and Descend.”",
      "active_name": "Glitch time",
      "active_effect": "Once this action is taken, for the rest of this scene, 1/round when any attack, effect, or action is made by one character successfully against another character inside the lich’s sensor range (deals damage, inflicts a condition, etc), the lich can instantly disrupt time, interrupting that action before it fully resolves. This is not a reaction. Effects that target self cannot be interrupted this way.<br>The targeted character is pushed up to 3 spaces in a direction of the Lich’s choice, even if it is normally immune to involuntary movement. Then the Lich places itself in one of the spaces that character originally occupied, or as close as possible, no matter how far away it was, counting as teleporting.<br>The Lich becomes the new target of that attack, effect, or action. All damage, conditions, or effects of the action now affect the Lich, and the action must be performed as if targeting the original character. For example, if the effect was to teleport a friendly character to a space, the Lich is teleported instead to that space. If the effect was to repair the a character, the Lich is repaired instead. If the effect was to deal damage and knockback, the Lich takes the damage, using the Lich’s armor, resistance, etc, and is knocked back the same direction the original character would be. If the effect was a condition or status, the Lich takes that condition or status instead.",
      "tags": [
        {
          "id": "tg_quick_action"
        }
      ]
    },
    "data_type": "frame",
    "aptitude": {}
  },
  {
    "id": "mf_sunzi",
    "source": "HA",
    "name": "SUNZI",
    "mechtype": [
      "Support",
      "Controller"
    ],
    "y_pos": 23,
    "description": "The SUNZI is at the peak of Harrison Armory development in weapons-applicable blink technology, a FRAME that was introduced as late as 5007U to select pilots only. Like the NAPOLEON, it is a compact, highly experimental frame with very limited battlefield presence, using powerful Blackshield technology to tear and warp the physical dimensions of space momentarily. Distortions of this kind are short lived, usually (but not always) visible to the naked eye, and highly unstable. Rumors abound that the SUNZI contains stolen or corrupted Volador technology from the ancient city-ship Mothers Gather and Are Welcome, parts of the extremely advanced machinery that allows their world-ships to remain in blinkspace seemingly indefinitely.<br>Owners of SUNZI licenses waive their privacy rights as part of the extensive (and physically exhausting) licensing process and are often in direct contact with personal handlers from Ras Shamra’s testing forges wishing to collect data.",
    "mounts": [
      "Main/Aux"
    ],
    "stats": {
      "size": 1,
      "armor": 1,
      "hp": 7,
      "evasion": 7,
      "edef": 8,
      "heatcap": 7,
      "repcap": 3,
      "sensor_range": 15,
      "tech_attack": 1,
      "save": 11,
      "speed": 4,
      "sp": 7
    },
    "traits": [
      {
        "name": "Safe Harbor",
        "description": "Any character other than the Sunzi that teleports always considers free space adjacent to the Sunzi as valid space to teleport to, as long as the Sunzi is in range 50 from them."
      },
      {
        "name": "Anchor",
        "description": "The Sunzi cannot be teleported unwillingly."
      },
      {
        "name": "Slip",
        "description": "1/round the Sunzi can teleport 1 space as a free action"
      }
    ],
    "core_system": {
      "name": "Reality Carver",
      "description": "MEMO(TT_CLEARANCE_01): YOU’RE GOING TO READ SOME OBTUSE SHIT HERE. I’VE TRANSCRIBED ONLY THE USEFUL PARTS OF THE VOLS SAID. REFER TO THE VISUAL FOR CORRESPONDING HAND SIGNS. REFER TO REPORTS: VESSEL-PILOT-DOORWAY",
      "active_name": "Art of War",
      "active_effect": "When you take this protocol, gain limited (6) charges until the rest of this scene. You can expend a charge to choose any hostile or allied character in sensor range and line of sight as a reaction to the start of their turn and teleport that character up to 3 spaces in any direction, as long as they end in a free valid space that they can stand on.",
      "tags": [
        {
          "id": "tg_protocol"
        },
        {
          "id": "tg_reaction"
        },
        {
          "id": "tg_limited",
          "val": 6
        }
      ],
      "passive_name": "Blink Anchor",
      "passive_effect": "The Sunzi has a blink anchor, a deployable system that is a size 1/2 object immune to all damage and effects (it is a stable point in space). It has limited (2) charges. It can be deployed or picked up and carried around by the Sunzi or any adjacent allied character as a quick action. When any character teleports within line of sight of the Sunzi, it can spend a reaction and a charge to change the end point of the teleport to free valid and adjacent space to the blink anchor instead of the teleporting character’s original target, as long as the character can safely stand in that space."
    },
    "data_type": "frame",
    "aptitude": {}
  },
  {
    "id": "mf_zheng",
    "source": "IPS-N",
    "name": "ZHENG",
    "mechtype": [
      "Striker"
    ],
    "y_pos": 30,
    "description": "The ZHENG is a relatively new frame in the IPS-N line and is unusual in that its creation can be attributed almost completely to a single mech operator - Xiong Xiaoli, a Mirrorsmoke mercenary operating out of the Long Rim, protecting Armory shipments of supplies to the early Dawnline shore colonies. A relative unknown before the incident, her convoy was attacked by the White Tiger pirate conglomerate and her entire company was KIA.<br>Xiaoli’s Raleigh was almost totally ripped apart in the ensuing chaos, but she managed to activate a distress beacon and attach it to her mech. Over the next forty five days she survived by scavenging the collapsing and melting wreck of the huge transport ship M.S. Say No More, managing to outsmart the fifty or so pirates searching for her by steadily modifying her mech for unarmed, CQB combat. In an tight, close environment where the ship’s decaying reactor core made combustible ranged weapons incredibly dangerous, she showed incredible efficacy and ingenuity. Xiaoli did not survive, perishing hours before the relief fleet arrived, but bought enough time that MSMC was able to position itself to both resupply the colony, fulfilling its contract, and deal a mortal blow to the Tigers, wiping the pirates out completely in the following skirmishes. Her mech was purchased by IPS-N frame development and the Zheng was introduced shortly afterwards based on her improvements.<br>Xiaoli is widely regarded as a Bodhisattva by many Long Rim colonists and nearly all MSMC mercs are familiar with the several drinking games named after her.",
    "mounts": [
      "Main",
      "Main",
      "Heavy"
    ],
    "stats": {
      "size": 1,
      "armor": 2,
      "hp": 10,
      "evasion": 9,
      "edef": 6,
      "heatcap": 6,
      "repcap": 6,
      "sensor_range": 3,
      "tech_attack": -2,
      "save": 10,
      "speed": 3,
      "sp": 5
    },
    "traits": [
      {
        "name": "Destructive Swings",
        "description": "At the end of your turn, if you made at least one melee attack against another hostile character, create a size 1 piece of terrain that grants hard cover in a free adjacent space (10 HP, 5 evasion)"
      },
      {
        "name": "Weak Computer",
        "description": "The Zheng gets +1 difficulty on all systems saves and checks"
      }
    ],
    "core_system": {
      "name": "Xiaoli-Type CQB Suite",
      "description": "Using scavenged materials from a dying ship and surviving mostly on rations intended for colonists and an increasingly more radioactive air supply, Xiaoli was able to create modifications that gave her mech unprecedented unarmed striking power.",
      "active_name": "Xiaoli’s Ingenuity",
      "active_effect": "Gain 6 charges (you can use a die to track this). For the rest of this combat, you can spend a charge to take this frame's passive action again, ignoring the 1/turn limit. You can spend any number of charges a turn, then regain a charge for each unique target (character, object, or piece of terrain) you damaged with this action, up to a maximum of 6.",
      "tags": [],
      "passive_name": "Xiaoli-Type CQB Suite",
      "passive_effect": "Once during your turn as a free action, you can move up to 3 spaces then deal 2 kinetic damage to any adjacent character, object, or piece of terrain. This movement must obey engagement and does not ignore reactions.<br>If an object or piece of terrain took this damage, it instead takes 10 AP kinetic damage. If it's destroyed, it explodes, dealing 1d6 kinetic damage to all adjacent characters other than you and knocking them back 1 space."
    },
    "data_type": "frame",
    "aptitude": {},
    "counters": [
      {
        "id": "ctr_xiaoli_type_cqb_suite",
        "name": "XIAOLI DIE",
        "default_value": 6,
        "min": 0,
        "max": 6
      }
    ]
  }
]