[
  {
    "id": "wm_supermassive_mod",
    "name": "Supermassive Mod",
    "sp": 1,
    "allowed_types": [
      "Melee",
      "CQB",
      "Cannon"
    ],
    "source": "IPS-N",
    "license": "CALIBAN",
    "license_level": 1,
    "effect": "Choose one CQB, CANNON, or MELEE weapon: it gains OVERKILL and KNOCKBACK +1. During a FULL REPAIR, you may tune it to remove safety limiters, increasing this benefit to KNOCKBACK +2 instead; however, it also gains ORDNANCE (if it is ranged) or INACCURATE (if it is melee).",
    "description": "The first in a suite of best-practice modifications for close-quarters combat out of the same Titan–Enceladus Field Project that produced the Caliban, supermassive mods include a host of alterations to close-quarters weapons designed to enhance their general lethality and utility by lifting safety precautions.",
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "added_tags": [
      {
        "id": "tg_overkill"
      },
      {
        "id": "tg_knockback",
        "val": 1
      }
    ],
    "license_id": "mf_caliban"
  },
  {
    "id": "wm_molten_wreathe",
    "name": "Molten Wreathe",
    "sp": 2,
    "allowed_types": [
      "Melee"
    ],
    "source": "IPS-N",
    "license": "ZHENG",
    "license_level": 2,
    "effect": "Choose one MELEE weapon: 1/round, after you hit a character with this weapon, you take 1 Heat and it projects a superheated Cone 3 cloud oriented away from your target in a direction of your choice. Your target and any characters caught in this cloud each take 2 Explosive Damage.",
    "description": "Needing a significant boost to her Raleigh’s melee capacity, Xiong decided upon a crude but effective solution: she would re-route her Raleigh’s coldcore dispersion systems into the chassis’ palms with a simple on/off switch, allowing it to superheat equipped weapons. The resultant ad hoc thermal weapon is so hot that it prompts an explosive vaporization of hard and soft surfaces on impact, creating a secondary backblast cloud that is a deadly weapon in its own right. The production version of this system simply adds a sturdier, dedicated routing system and better insulation.",
    "license_id": "mf_zheng"
  }
]