[
  {
    "id": "ms_multi_gear_maneuver_system",
    "name": "MULTI-GEAR MANEUVER SYSTEM",
    "type": "System",
    "sp": 1,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_quick_action"
      }
    ],
    "source": "SSC",
    "license": "ATLAS",
    "license_level": 1,
    "effect": {
      "effect_type": "Basic",
      "activation": "Quick",
      "detail": "Fire a zip line 8 spaces long that connects two free spaces you can see (the first space must be adjacent to you). The ends of the line must be attached to a surface, such as a wall or floor. It activates at the end of your turn, granting the following benefits:<li>Size 1/2 characters that are able to grab onto the line that are adjacent to either the start or end point of the zipline can move to the other end as a quick action. They can hop off at any point along the line if they wish.<li>Characters size 1 or larger that cross the line’s space for the first time in a round or start their turn in the line's space must pass an agility save or fall prone.<br>A character can tear down the zip line by passing a hull check as a quick action adjacent to the start or end point of the line, or successfully performing a melee attack against the start or end of the line (evasion 10, 1 HP). Destroying the zip line in this way does not destroy this system and it can be re-used. The line lasts until destroyed or until you use this system again."
    },
    "description": "Used by Sparri hunters to bridge the vast gaps in the ice sheet that cover their world, this system is in high demand and often used by daredevils and thrill-seekers the world over.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_jäger_kunst_i",
    "name": "JÄGER KUNST I",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_protocol"
      },
      {
        "id": "tg_heat_self",
        "val": 1
      }
    ],
    "source": "SSC",
    "license": "ATLAS",
    "license_level": 2,
    "effect": {
      "effect_type": "Protocol",
      "name": "JÄGER KUNST I",
      "detail": "Until the end of your current turn, each time you move adjacent to an object or free standing piece of terrain larger than your mech, your mech moves 2 spaces in any direction as a free action, ignoring engagement and reactions (your mech wall runs, tumbles, or slides around). This effect can trigger multiple times a turn, but only once for each unique object or piece of terrain."
    },
    "description": "Converted from earlier hardsuit-only martial arts, Jäger Kunst pushes the form beyond human parameters, enabling actions and motions faster than human thought. Many ATLAS suits can be printed with the suite of combat forms already enabled — though letting the chassis perform these movements without learning them yourself can lead to catastrophic self-injury.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_ricochet_blades",
    "name": "RICOCHET BLADES",
    "type": "System",
    "sp": 3,
    "tags": [
      {
        "id": "tg_limited",
        "val": 3
      }
    ],
    "source": "SSC",
    "license": "ATLAS",
    "license_level": 2,
    "effect": {
      "effect_type": "Basic",
      "activation": "Quick",
      "detail": "Mark a line 3 area from your mech. All characters caught within must pass an agility save or take 1d3+2 kinetic damage on a failed save. If the line from the initial throw of this weapon hits a piece of terrain or object size 1 or larger, repeat the line from that object in a new direction that doesn't overlap the object it ricocheted off, forcing all characters caught within to make a new agility save or take 1d3+2 kinetic damage on a failed save."
    },
    "description": "These disc-shaped blades are designed, produced, and hand-finished by SSC’s Toledo blade enclave. The material is flexible enough to bounce when striking off surfaces, but sharp enough to slice bone and metal. Unlike the more restrictive Terashima enclave’s edged weapons, the Toledo enclave produces these edged weapons with the expectation that they’ll be used and discarded; this does not impact their quality, but does lead to supply shortages from time to time. This exclusivity is desired by SSC; due to their comparative rarity, Toledo discs are often used as currency between Sparri espadas, and their use in combat or hunting is a marker of status.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_jäger_kunst_ii",
    "name": "JÄGER KUNST II",
    "type": "System",
    "sp": 3,
    "tags": [
      {
        "id": "tg_reaction"
      },
      {
        "id": "tg_limited",
        "val": 3
      },
      {
        "id": "tg_round",
        "val": 1
      }
    ],
    "source": "SSC",
    "license": "ATLAS",
    "license_level": 3,
    "effect": {
      "effect_type": "Reaction",
      "name": "Fatal Clash",
      "frequency": "1/round",
      "trigger": "You take or deal damage with or from a melee attack.",
      "detail": "Both you and your target roll a contested hull or agility check (each side chooses which independently). The loser is knocked prone, takes 1d6 kinetic damage, and is knocked back 3 spaces in the direction of the winner’s choosing.<br>The winner can then move 3 in any direction, ignoring engagement and not provoking reactions. In case of a tie, the contest immediately ends.<br>The loser of this contest can immediately force a re-roll of this contest by taking 2 AP kinetic damage if they lose. This damage cannot be prevented or reduced in any way. This contest continues until one side accepts the result or would take a point of structure damage, in which case they immediately lose."
    },
    "description": "The rarest of ATLAS mechs can be printed with the residual muscular memories of Jäger Kunst masters embedded in them, old Sparri and others that have dedicated lives to their martial art. SSC does not recommended using these embedded systems without proper bodily tempering, and will not release these programs to unqualified pilots.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_hardpoint_reinforcement",
    "name": "HARDPOINT REINFORCEMENT",
    "type": "Shield",
    "sp": 2,
    "tags": [
      {
        "id": "tg_shield"
      }
    ],
    "source": "IPS-N",
    "license": "CALIBAN",
    "license_level": 2,
    "effect": "As long as it’s not slowed or immobilized, your mech has resistance to all damage during its turn.",
    "description": "Also developed out of IPS-N’s ongoing Titan-Enceladus Field Project, hardpoint reinforcement systems further strengthen chassis, ensuring a 10% efficiency in TTK per unit.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_spike_charges",
    "name": "SPIKE CHARGES",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_limited",
        "val": 2
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "IPS-N",
    "license": "CALIBAN",
    "license_level": 2,
    "effect": {
      "effect_type": "Charge",
      "charges": [{
          "name": "Spike Grenade",
          "charge_type": "Grenade",
          "range": [{
            "type": "Range",
            "val": 5
          }],
          "detail": "If a character is targeted by this grenade, it must pass an agility save or have the grenade attach to them, where it arms. If an object is targeted, it simply attaches. At the start or end of any turn while a grenade is attached, you can cause all spike grenades to detonate as a reaction, dealing 1d6 kinetic damage to whatever they’re attached to and knocking back any characters they’re attached to 3 spaces in any direction. A character can detach a grenade by successfully repeating this save as a quick action on their turn, else they detach at the end of the scene."
        },
        {
          "name": "Spike Mine",
          "charge_type": "Mine",
          "range": [{
            "type": "Burst",
            "val": 2
          }],
          "detail": "Once activated, all characters caught in the burst must pass an agility save or have a spike grenade attach to them as described above."
        }
      ]
    },
    "description": "A load variant originally designed for the Hammer U-RPL, the “Spike” system packs dozens of hardened flechettes designed to tumble, ricochet, and pierce upon shell detonation, tearing apart flesh and soft targets with sheer torque. As a payload for either an impact-activated grenade or proximity activated mine, these weapons found their use first in micro/null grav combat, where vessels and units flying out of control could be turned into missiles themselves; in gravity-well combat, is system is less deadly, but no less chaotic.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_rapid_maneuver_jets",
    "name": "RAPID MANEUVER JETS",
    "type": "System",
    "sp": 4,
    "tags": [
      {
        "id": "tg_overshield"
      },
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_heat_self",
        "val": 1
      },
      {
        "id": "tg_round",
        "val": 1
      }
    ],
    "source": "IPS-N",
    "license": "CALIBAN",
    "license_level": 3,
    "effect": "1/round when your mech boosts, it flies, gains overshield 5 and it ignores engagement from and may freely pass through the spaces of other characters larger than it (but not end its turn in their spaces).",
    "description": "Further streamlining and miniaturizing IPS-N’s Ramjet system, IPS-N’s new RMJ chassis-volatility package increases a chassis’ control envelope, ensuring a pilot can maintain enhanced mobility at-pace — this control, coupled with a raw increase in speed, makes any chassis far more difficult to successfully engage.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_forge_clamps",
    "name": "FORGE CLAMPS",
    "type": "System",
    "sp": 1,
    "tags": [
      {
        "id": "tg_quick_action"
      }
    ],
    "source": "HORUS",
    "license": "KOBOLD",
    "license_level": 1,
    "effect": {
      "effect_type": "Basic",
      "activation": "Quick",
      "detail": "Your mech sinks pitons into an adjacent piece of terrain or object size 1 or larger. While clamped on this way, your mech is immobilized but is immune to knock back and prone. This effect ends if whatever you’re clamping on to is destroyed or if you end it as a protocol."
    },
    "description": "Repurposed from polycrete foundry tongs, these simple manipulators are incredibly resistant to heat and deformation. Using the KOBOLD protocols, once inert Forge Clamps become the adherent surface for thin plasma sheathes — when active, these tongs become like blades, able to shear through armor, earth, and bulkhead with ease. A common tactic involves “flashing” plasma across the Clamps, fusing them to their target until the Kobold pilot “flashes” them free.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_seismic_pulse",
    "name": "SEISMIC PULSE",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_full_action"
      }
    ],
    "source": "HORUS",
    "license": "KOBOLD",
    "license_level": 2,
    "effect": {
      "effect_type": "Basic",
      "activation": "Full",
      "detail": "Draw a line 10 area from your mech. Characters caught in the area, allied or enemy, must pass a hull save or be knocked prone. All objects and pieces of terrain in the area take 10 AP energy damage, no roll required. If a piece of terrain or object is destroyed this way, it explodes in a burst 1 area. Characters caught in the area must pass an agility save or take 2d6 explosive damage, and half on a successful check. A character can only be affected by one explosion at once, even if multiple overlap."
    },
    "description": "A deadly weapon, created from simple shaped charges — the perfect catalyst for insurrection. Easily obtained and disguised as necessary equipment for blast-mining, the charges that produce a linear seismic pulse were common in the early days of Ungrateful activity. As Baronic security adapted their strategies, so too did the Ungratefuls; now, these once-simple explosive devices are much more complex — harder to detect, and far more deadly.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_purifying_code",
    "name": "PURIFYING CODE",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_invade"
      }
    ],
    "source": "HORUS",
    "license": "KOBOLD",
    "license_level": 3,
    "effect": {
      "effect_type": "Tech",
      "activation": "Quick",
      "option_set": "Invade",
      "options": [{
        "name": "FLAW_plus",
        "detail": "The target is aware of this effect.<br>On a successful invasion, this implants the target’s reactor with a memetic virus that requires proximity to clear. At the end of their next turn, if your target is not adjacent to another character (allied or enemy) or piece of terrain size 1 or larger, the virus catalyzes and they take 1d6+2 AP explosive damage. The effect then ends.<br>FLAW_minus and FLAW_plus are mutually exclusive (a character cannot be affected by both)."
      }, {
        "name": "FLAW_minus",
        "detail": "The target is aware of this effect.<br>On a successful invasion, this implants the target’s reactor with a memetic virus that reacts to proximity. At the end of their next turn, if your target is adjacent to another character or piece of terrain size 1 or larger, the virus catalyzes and it takes 1d6+2 AP explosive damage. The effect then ends.<br>FLAW_minus and FLAW_plus are mutually exclusive (a character cannot be affected by both)."
      }]
    },
    "description": "The key to the KOBOLD’s creation — a deceptively simple code that unlocks reactor safety limiters in civilian mining mechs. This also bears the only evidence pointing towards a possible creator: “Dog.”",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_immolate",
    "name": "IMMOLATE",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_invade"
      }
    ],
    "source": "HORUS",
    "license": "KOBOLD",
    "license_level": 3,
    "effect": {
      "effect_type": "Tech",
      "activation": "Quick",
      "option_set": "Invade",
      "options": [{
        "name": "Eject Slag",
        "detail": "On hit, the target’s reactor ejects burning liquid in a burst 2 area around it. The space the target physically occupies is not affected. The liquid is difficult terrain, and characters that start their turn in it or enter it for the first time in a round must pass an engineering save or take 2 heat and 1 burn. It cools at the end of your next turn, dissipating."
      }, {
        "name": "Molten Puncture",
        "detail": "On hit, until the end of its next turn, for each space the target moves voluntarily, it takes 2 Burn, up to a maximum of 6 Burn."
      }]
    },
    "description": "The Kobold PG code is unique in that it can be injected into existing civilian mining mechs, affording them the ability to interact with the K-PG’s suite of largely improvised, adapted weaponry and systems. The process skips printers entirely; in avoiding the constraints of Union-monitored printers, the process also eschews widely accepted safety standards — a common theme among PGs developed by HORUS. With no governors or consistent standards on the operational envelope of the K-PG, some of its operators have found out the hard, terminal way the limits of their chassis.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_tear_firmament",
    "name": "TEAR FIRMAMENT",
    "type": "Tech",
    "sp": 1,
    "tags": [
      {
        "id": "tg_full_tech"
      }
    ],
    "source": "HORUS",
    "license": "LICH",
    "license_level": 1,
    "effect": {
      "effect_type": "Tech",
      "activation": "Full",
      "name": "Tear Firmament",
      "detail": "Create a blast 2 zone within line of sight. While inside the zone, characters other than you cannot take reactions, and any character except you that starts its turn inside the zone must pass a systems save or take 2 heat and become slowed until the end of its next turn. The zone persists until this action is taken again or the scene ends."
    },
    "description": "Speaker 1 (M.A2.SP1) [Audio, Length: 150:06][Dated 7658U, 35:50] (recovered: GZ Alhambra) [UIBTERMAGANT-TANGENT ROYAL]<br>“Where does it go? Where does it go? Where does it go? Where does it go? Where does it go? Where does it go? Where does it go? Where does it go? Where does it go? Where does it go?",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_rewrite",
    "name": "REWRITE",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_quick_tech"
      }
    ],
    "source": "HORUS",
    "license": "LICH",
    "license_level": 2,
    "effect": {
      "effect_type": "Tech",
      "activation": "Quick",
      "detail": "Choose a character in sensor range and line of sight. All conditions on that character other than stunned (slowed, impaired, jammed, lock on, shredded) immediately end and transfer to you. These conditions last until the end of your next turn."
    },
    "description": "M.A2.SP1 [Audio loop, length 93:03][Dated 5008U, 16:50] (recovered: GZ Alhambra) [UIB-TERMAGANTTANGENT ROYAL]<br>“I have never been here: I do not know where here is: It has not happened yet: Once, I was: I have never been here: You are all I see: How can you be all I see: Where am I: Where did I go: I have never been here…”",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_unhinge_chronoflow",
    "name": "UNHINGE CHRONOFLOW",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_quick_tech"
      }
    ],
    "source": "HORUS",
    "license": "LICH",
    "license_level": 2,
    "effect": {
      "effect_type": "Tech",
      "activation": "Quick",
      "option_set": "Quick Tech",
      "options": [{
        "name": "Haste",
        "detail": "Choose a character in sensor range and line of sight. For the rest of this scene, or until the chosen character takes damage, 1/round on its turn it make take the boost action as a free action."
      }, {
        "name": "Slow",
        "detail": "Choose a character in sensor range and line of sight. That character must pass a systems save or take 2 heat, become slowed, and become unable to take reactions. This effects ends if it takes any amount of damage. It can also end this effect by taking a quick action and successfully repeating this save."
      }]
    },
    "description": "M.A2.SP2 [Audio loop, diversion instance #1, timestamp 45:50] (recovered: GZ Alhambra) [UIBTERMAGANT-TANGENT ROYAL]<br>“Dark. Wet. Drink deep, and descend. The water is warm and well. It is very busy here, though you cannot see it. The swimmers are curious. The flea always jumps from time to time. It will drink it all. It will drink it deep—“",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_stay_of_execution",
    "name": "STAY OF EXECUTION",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_quick_tech"
      },
      {
        "id": "tg_limited",
        "val": 2
      }
    ],
    "source": "HORUS",
    "license": "LICH",
    "license_level": 3,
    "effect": {
      "effect_type": "Tech",
      "activation": "Quick",
      "detail": "Choose either your mech or another character in sensor range and line of sight. The chosen character is immune to all damage, conditions, and all other effects not caused by itself until the end of its next turn. At the end of its next turn, it is stunned until the end of its following turn. Nothing can prevent or remove this stun.<br>Effects that were active before are frozen in time and effectively ‘paused’ and the turn passed in this state does not count down their timer. For example, conditions that were active on the targeted character that would expire at the end of their turn now expire at the end of their following turn (the turn spent immune does not count), reactor meltdown timers would not tick down while in this state, etc.<br>An unwilling character can pass a systems save to avoid this effect."
    },
    "description": "Speaker 1 (M.A2.SP1) [Audio, Length: 150:06][Dated 5006U, 01:50] (recovered: GZ Alhambra) [UIBTERMAGANT-TANGENT ROYAL]<br>“I felt the bullet tear through me. I felt the bullet tear through me. I felt the pressure and it was my brother, his fist, my chest, and I was laying on my back and the sky was blue, and my mother hollered at him and the bullet had never hit me, and the legionnaire who shot me had not yet pulled the trigger, and so I killed him. I drank deep and killed him.”",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_didymos_class_nhp",
    "name": "DIDYMOS-CLASS NHP",
    "type": "Tech",
    "sp": 3,
    "tags": [
      {
        "id": "tg_ai"
      },
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_quick_tech"
      },
      {
        "id": "tg_limited",
        "val": 3
      }
    ],
    "source": "HORUS",
    "license": "LICH",
    "license_level": 3,
    "effect": {
      "effect_type": "AI",
      "detail": "Your mech gains the AI property and the following quick tech action.",
      "abilities": [{
        "name": "Time split",
        "effect_type": "Tech",
        "activation": "Quick",
        "detail": "Choose either your mech or another character in sensor range and line of sight. A hostile or unwilling character can pass a systems save to avoid this effect. The original character disappears, and you create a chronological split in their timeline, replacing them with two fields of mutating paradox energy that must be placed as close to its original position as possible. Each field is a brand new character the same size as the targeted character that looks like a hole in space shaped roughly like the original character (don’t look at it too long though). It has 10 HP, 5 heat, 5 speed, 5 evasion, and 5 e-defense, and is immune to all conditions. It is controlled by the original player, and both act on their turn, starting with their next activation. It can’t take reactions except to disperse (see below), and the only actions of any kind it can take on its turn is a standard move and a boost action. It provides obstruction and grants hard cover.<br>If a field overheats or is reduced to 0 HP, it immediately disappears. The controlling character can also cause a field to disappear as a reaction from that field to the end of any character’s turn.<br>If one field disappears, the other immediately transforms into the original character, placing them back on the battlefield in the field’s space. If both fields disappear at the same time (due to reaction fire, etc), the field’s controller decides which field disappears first."
      }]
    },
    "description": "PREPARED BY: UIB-TERMAGANT<br>RECOVERED FOR: CC_HOME OFFICE<br>CLEARANCE REQ: SOLEMN VIGIL (TANGENT ROYAL ADDENDUM)<br>Didymos. It means twin in an old, old tongue. It might be a bit too cute but it’s the name our cask spat out for us.We observed Didymos Prime in action during the fall of Green Zone Alhambra, mounted in a chassis we initially classified as a HORUS Minotaur PG, one of three we ID’d operating among the Ungrateful cell in New Madrassa.<br>It was not that Minotaur.<br>Alhambra fell in three days. The Armory wasn’t keen to give it up, but decided to cut their losses and pull back rather than hold for reinforcements. We moved in after, during the looting. Our local contact [][][][][][][][] escorted us to the New Madrassan commanders, introduced us to them, and secured an audience with the pilot of the chassis.<br>I’m sure you’ve reviewed the records of the debrief we recorded. We don’t know how it arrived in New Madrassa; the Ungratefuls say they received the initial code burst from their contact in the Voladores. The Voladores deny this; the entity, however, conforms to their descriptions of an entity called “la pulga,” or, “The Flea.” We have designated it LITCH. Didymos is the active animus: what serves as its pilot.<br>We have taken the entity into custody. We do not recommend giving this one a long leash.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_accelerate",
    "name": "ACCELERATE",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_quick_tech"
      }
    ],
    "source": "HA",
    "license": "SUNZI",
    "license_level": 1,
    "effect": {
      "effect_type": "Tech",
      "activation": "Quick",
      "detail": "Choose and mark two free visible spaces on the ground or the same surface within range 5 of each other. Characters that enter either space for the first time in a round or start their turn there are pushed in a straight line as far as possible towards the other space. If they would collide with another object or character, they stop moving. Grenades, deployables, or other loose objects size 1 or smaller that are thrown or deployed into one space are pushed in the same way towards the other space before activating or detonating (they activate or detonate early if they are forced to stop by another character or object). The area lasts until the end of the scene or if you take this action again, and characters caught in either area can pass a hull save to avoid this effect."
    },
    "description": "Memo, no es suficiente saber caminar; Debes saber dónde y dónde no pisar. El lugar incorrecto, y te perderás. Es en un plano de telaraña donde construimos nuestro hogar: pise ligeramente cuando vaya.<br>[Memo, it is not enough to know how to walk; you must know where and where not to step; the incorrect spot, and you will be lost.<br>It is on a plane of gossamer that we make our home: tread lightly when you go]",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_blink_charges",
    "name": "BLINK CHARGES",
    "type": "Deployable",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": 3
      }
    ],
    "source": "HA",
    "license": "SUNZI",
    "license_level": 1,
    "effect": {
      "effect_type": "Charge",
      "charges": [{
          "name": "Blink Mine",
          "charge_type": "Mine",
          "detail": "Once activated, this mine teleports the character that triggered it to a free valid space of your choice within range 5 of the mine and they become jammed until the end of their next turn. A character can pass an engineering save to avoid the Jamming effect but is still teleported."
        },
        {
          "name": "Warp Grenade",
          "charge_type": "Grenade",
          "detail": "On impact, you can teleport any character (hostile or allied) in the affected area to any free valid space within the same area. Characters can pass an engineering save to avoid this effect.",
          "range": [{
            "type": "Range",
            "val": 5
          }, {
            "type": "Blast",
            "val": 3
          }]
        }
      ]
    },
    "description": "Eso es lo que no se suena: usar el vacio contra la Ley de la Madre. Marcamos esta en nuestro historia con lagrimas, y ennegrecer la pagina.<br>[This is the thing un-thinkable: to use the nonshape against the Mother’s Law. With tears, we mark its need in our history, and then blacken the page]",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_distort",
    "name": "DISTORT",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_quick_tech"
      }
    ],
    "source": "HA",
    "license": "SUNZI",
    "license_level": 2,
    "effect": {
      "effect_type": "Tech",
      "activation": "Quick",
      "detail": "You tear a hole in space, creating a blast 1 area in free visible space in sensor range. Weapons with the blast, line, burst, or cone tags exclude the zone’s space from their area of effect. Characters and objects cannot occupy the same space as the zone. Any character or object that moves at least 1 space into the zone immediately teleports to any free adjacent space of it or its owner’s choice to the zone, or as close as possible if there is no free space.<br>The zone blocks line of sight. However, any character (hostile or allied) may target the zone with a ranged weapon without the line, blast, burst, or cone tags as if making an attack against it. Don’t roll to hit the zone - instead the zone absorbs and re-targets the weapon's attack against a new target of the attacker's choice within range 10 of the zone. Make the attack as if the attack was fired from the zone instead (for purposes of line of sight, cover, etc).<br>The zone lasts until the end of the current scene, if you take this action again, or if you destroy it with a quick action."
    },
    "description": "Dicen: \"Incluso es difícil de ver en este lugar\". Decimos: \"Usted tiene razón. Es porque este lugar no te quiere aquí.”<br>[They say: “It is even difficult to see in this place.” We say: “You are correct. It is because this place does not want you here.”]",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_blinkspace_tunneler",
    "name": "BLINKSPACE TUNNELER",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_quick_action"
      }
    ],
    "source": "HA",
    "license": "SUNZI",
    "license_level": 3,
    "effect": {
      "effect_type": "Basic",
      "activation": "Quick",
      "detail": "Mark a free adjacent space to your mech and open up a blink tear. The tear lasts until the end of your next turn. Any character other than you (hostile or allied) that at least partly enters that space as part of any movement can teleport to a free adjacent space to your mech’s current location at the time of their move as a free action or reaction. You can only have one tear open at once, and each one created replaces the previous one."
    },
    "description": "MEMO(TT_CLEARANCE_01) (01200): IT’S GONNA GET REAL FUCKING DARK.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_unravel",
    "name": "UNRAVEL",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_quick_tech"
      }
    ],
    "source": "HA",
    "license": "SUNZI",
    "license_level": 3,
    "effect": {
      "effect_type": "Tech",
      "activation": "Quick",
      "detail": "Either you or another character of your choice in your sensor range and line of sight is charged with unstable energy until the start of your next turn. Each time that character takes damage for that duration, you can teleport that character up to 3 spaces in any direction to a free valid space as a reaction. Unwilling characters can pass an engineering save to avoid this effect entirely."
    },
    "description": "Dicen: \"Cuéntanos el secreto de tu larga vida, o abriremos la puerta de tu hogar a todo el mundo\".<br>Nosotros decimos: “Para vivir una larga vida, vives una larga vida. No tenemos secretos, todo lo que tenemos es el conocimiento que deseamos ocultarle. Por favor no hagas esto; tu no sabes nada.\"<br>[They say: “Tell us the secret to your long life, or we shall swing wide our door, and let those who we hold back inside your safe ground.”<br>We say: “To live a long life, you live a long life. We have no secrets, all we have is knowledge we wish to keep from you.”]",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_total_strength_suite_i",
    "name": "TOTAL STRENGTH SUITE I",
    "type": "System",
    "sp": 1,
    "tags": [
      {
        "id": "tg_quick_action"
      }
    ],
    "source": "IPS-N",
    "license": "ZHENG",
    "license_level": 1,
    "effect": {
      "effect_type": "Basic",
      "activation": "Quick",
      "detail": "Rip up a piece of the environment and hurl it at your enemy. Choose a character in range 5 and line of sight. That character must pass an agility save or take 1d6 kinetic damage and be knocked back 1 space directly away from you. After taking this action, even if your target makes their save, create a size 1 piece of terrain that grants hard cover (10 HP, 5 evasion) in a free adjacent space to your target.<br>If you already have a piece of cover adjacent to you of size 1, you can move it as part of this action, otherwise you rip it out of the ground or environment (if there's nothing to grab nearby or you're not on the ground you can't take this action)"
    },
    "description": "This system-wide upgrade was the result of Xiong Xiaoli’s tweaks to her mech over the course of many years of MSMC work incorporating into core IPS-N frame construction protocol. As a package, it comes in three stages, the first of which is a set of spinal enhancements allowing a mech to rapidly lift and move high amounts of weight without systemic damage.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_total_strength_suite_ii",
    "name": "TOTAL STRENGTH SUITE II",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_protocol"
      }
    ],
    "source": "IPS-N",
    "license": "ZHENG",
    "license_level": 2,
    "effect": {
      "effect_type": "Protocol",
      "detail": "Deal 1d6 kinetic damage to a character you are grappling."
    },
    "description": "The second part of Xiaoli’s enhancements: interlocking muscular-analogue plates beneath armor that greatly multiply crushing force.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_total_strength_suite_iii",
    "name": "TOTAL STRENGTH SUITE III",
    "type": "System",
    "sp": 3,
    "tags": [
      {
        "id": "tg_full_action"
      }
    ],
    "source": "IPS-N",
    "license": "ZHENG",
    "license_level": 3,
    "effect": {
      "effect_type": "Basic",
      "activation": "Full",
      "detail": "End a grapple to knock the character you’re grappling back 5 spaces in any direction and knock it prone. During this movement, it can freely pass through but not end its movement in other character's spaces. If it collides with an object or piece of terrain during its movement, it stops, takes 1d6 kinetic damage, and must pass a hull save or become stunned until the end of its next turn. All characters it passes through must pass a hull save or become knocked prone."
    },
    "description": "The last component of this upgrade suite gives a mech the ability to inject massive power into its locomotive systems in rapid bursts, resulting in short-lived but incredible strength. The effect is carefully balanced and misuse can cause a mech’s internal systems to rip themselves apart.",
    "data_type": "system",
    "aptitude": {}
  }
]