[
  {
    "id": "mw_kraul_rifle",
    "name": "KRAUL RIFLE",
    "mount": "Main",
    "type": "CQB",
    "damage": [
      {
        "type": "kinetic",
        "val": "1d6"
      }
    ],
    "range": [
      {
        "type": "Range",
        "val": 8
      }
    ],
    "tags": [
      {
        "id": "tg_inaccurate"
      }
    ],
    "source": "SSC",
    "license": "ATLAS",
    "license_level": 1,
    "effect": {
      "effect_type": "Offensive",
      "hit": "Your target is impaled by the harpoon-like projectile this weapon fires. Any time during your target’s next turn, you can reel in the line and take the boost action as a reaction to any of its actions or movement, as long as your boost moves towards that target by the most direct route possible. Your target must then pass a hull save or be knocked prone, and this effect ends. The line snaps if your target teleports."
    },
    "description": "Hunting the Vast — the titanic megafauna of Sparr — is an incredibly profitable venture. Their skins, meat, bone, and other trophies from their bodies can produce months — even, in rare cases when an especially old, grand, or unique Vast is felled — years of prosperity for the hunters and their kin. These popular long rifles, refined to SSC standards, are rugged and durable, and aid in dragging down the great beasts and their attendants.",
    "data_type": "weapon",
    "aptitude": {}
  },
  {
    "id": "mw_terashima_blade",
    "name": "TERASHIMA BLADE",
    "mount": "Main",
    "type": "Melee",
    "damage": [
      {
        "type": "kinetic",
        "val": "1d6"
      }
    ],
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_protocol"
      }
    ],
    "source": "SSC",
    "license": "ATLAS",
    "license_level": 3,
    "effect": {
      "effect_type": "Protocol",
      "detail": "Take one of the following stances. The stance continues until you take a new stance with this weapon, this weapon is destroyed, or your mech is stunned or jammed.<br>You can start any given fight in one of the following stances if you wish.<br><li><b>Troll Stance</b>: This weapon gains inaccurate, AP, and deals +3 damage.</li><li><b>Storm Stance</b>: 1/round after hitting with this weapon, you may immediately deal 2 kinetic damage to all other characters adjacent to you and your target as a reaction.</li><li><b>Lord’s Stance</b>: While in this stance, you cannot make ranged or tech attacks, but any ranged attack against you that misses deflects off your sword, dealing 2 kinetic, energy, or explosive damage (depending on the attack) to any character of your choice in range 3 and line of sight from you. Any melee attack that misses you in this stance forces the attacker to pass a hull save or become knocked prone.</li><li><b>Wind Stance</b>: This weapon gains reliable 2, threat 2, and knock back 2. After attacking with this weapon, hit or miss, you may move 2 spaces in any direction, ignoring engagement and reactions.</li>"
    },
    "description": "Forged in the fire of a corralled star in the Constellation, each of these blades bears a unique name and history defined by their users. Terashima blades are perfectly balanced and tempered, scalable from personal use to Schedule 3 — when combined with a frames’ weapon and sensor suites, they have been proven to be fast and durable enough to deflect weapons fire. Each blade crafted by the Terashima enclave is an heirloom produced once and delivered via conventional travel — their loss is considered an indescribable humiliation of the owner, and an incredible triumph by the one who has taken it. The Terashima enclave keeps the casting mold of each blade produced, and displays them in their central hall with known histories attached.",
    "data_type": "weapon",
    "aptitude": {},
    "sp": 2
  },
  {
    "id": "mw_hammer_u_rpl",
    "name": "HAMMER U-RPL",
    "mount": "Heavy",
    "type": "Launcher",
    "damage": [
      {
        "type": "explosive",
        "val": "2d6+3"
      }
    ],
    "range": [
      {
        "type": "Range",
        "val": 5
      }
    ],
    "tags": [
      {
        "id": "tg_inaccurate"
      },
      {
        "id": "tg_arcing"
      },
      {
        "id": "tg_knockback",
        "val": 2
      }
    ],
    "source": "IPS-N",
    "license": "CALIBAN",
    "license_level": 1,
    "effect": "",
    "description": "The “Hammer” Universal Rotary Projectile Launcher accepts any projectile or weapons system that fits IPS-N’s Universal Cartridge system. Most common is the conventional airburst shell — a fragmentation system designed to operate in all theaters, oxygenated or not — a ferocious weapon in the compact halls, safe rooms, and bolt chambers of capital ships and stations.",
    "data_type": "weapon",
    "aptitude": {}
  },
  {
    "id": "mw_hhs_155_cannibal",
    "name": "HHS-155 CANNIBAL",
    "mount": "Heavy",
    "type": "CQB",
    "damage": [
      {
        "type": "kinetic",
        "val": "2d6+4"
      }
    ],
    "range": [
      {
        "type": "Range",
        "val": 3
      },
      {
        "type": "Threat",
        "val": 3
      }
    ],
    "tags": [
      {
        "id": "tg_inaccurate"
      },
      {
        "id": "tg_loading"
      },
      {
        "id": "tg_knockback",
        "val": 2
      }
    ],
    "source": "IPS-N",
    "license": "CALIBAN",
    "license_level": 3,
    "effect": {
      "effect_type": "Offensive",
      "detail": "This heavy shotgun can be fired twice before it needs to be reloaded. Alternately, it can be fire with the Both Barrels profile.<br>When this weapon is reloaded, you may deal 6 kinetic damage to a character in range 3 from the force of the ejecting shells.",
      "abilities": [{
        "effect_type": "Profile",
        "name": "Both Barrels",
        "damage": [{
          "type": "kinetic",
          "val": "3d6+4"
        }],
        "tags": [{
          "id": "tg_knockback",
          "val": 4
        }],
        "detail": "Fire both barrels at once, causing the weapon to be fired with +1 additional difficulty and requiring a reload as normal."
      }]
    },
    "description": "The IPS-N Heavy Howitzer—Shotgun is a large, breech-loaded, over-under cannon chambered to fire 155mm shells, shot, and sabots. This is the higher powered version of the HHS-075, designed to phaseout the “Daisy Cutter” at a comparable power level while making it easier to supply armies in the field with the necessary ordinance. It has one design flaw, which is that the shells are ejected with enough velocity to decapitate an unarmored human.",
    "data_type": "weapon",
    "aptitude": {}
  },
  {
    "id": "mw_fusion_rifle",
    "name": "FUSION RIFLE",
    "mount": "Main",
    "type": "Rifle",
    "damage": [
      {
        "type": "energy",
        "val": "1-6"
      }
    ],
    "range": [
      {
        "type": "Range",
        "val": 6
      }
    ],
    "tags": [],
    "source": "HORUS",
    "license": "KOBOLD",
    "license_level": 1,
    "effect": {
      "effect_type": "Offensive",
      "hit": "This weapon deals damage equal to its range from the target instead of rolling for damage, up to a maximum of 6 damage."
    },
    "description": "Bootstrapped from powerful ore mining lasers, the simple Kobold Fusion Rifle is no less deadly for its humble origins. By burning through solid-state batteries to produce the necessary reaction, the Fusion Rifle’s simple operation proved easy enough for untrained Ungratefuls to learn. As their tactics improved and Baronic forces were pushed back, the KFR took on an iconic reputation, and now is a symbol of resistance across the Baronies — often seen stenciled on walls and crossed on Ungrateful flags.",
    "data_type": "weapon",
    "aptitude": {}
  },
  {
    "id": "mw_slag_cannon",
    "name": "SLAG CANNON",
    "mount": "Main",
    "type": "Cannon",
    "damage": [
      {
        "type": "energy",
        "val": "1d6"
      }
    ],
    "range": [
      {
        "type": "Range",
        "val": 8
      }
    ],
    "tags": [
      {
        "id": "tg_heat_self",
        "val": 1
      }
    ],
    "source": "HORUS",
    "license": "KOBOLD",
    "license_level": 2,
    "effect": {
      "effect_type": "Offensive",
      "attack": "Hit or miss, after this weapon attacks a target, if your target is on the ground or a flat surface, place a size 1 piece of terrain in a free adjacent space next to them (10 HP, evasion 5)."
    },
    "description": "Dripping with molten fury, the Slag Cannon is quick to print and requires little training to use effectively. Temperamental but powerful, the Slag Cannon utilizes a simple rawmat-decomp system wedded to an insulated projector to break down, superheat, and cast a stream of plural-state particles at its target. Once cast in this way, the plural-state particles snap into coherence at a range of roughly 80-100 meters, creating base-element lumps of slag wherever they come to rest.",
    "data_type": "weapon",
    "aptitude": {}
  },
  {
    "id": "mw_unraveler",
    "name": "UNRAVELER",
    "mount": "Main",
    "type": "Launcher",
    "damage": [
      {
        "type": "energy",
        "val": "2d6"
      }
    ],
    "range": [
      {
        "type": "Range",
        "val": 10
      }
    ],
    "tags": [
      {
        "id": "tg_reliable",
        "val": 2
      }
    ],
    "source": "HORUS",
    "license": "LICH",
    "license_level": 1,
    "effect": {
      "effect_type": "Offensive",
      "hit": "If the damage from this weapon does not destroy its target or cause it to take 1 structure damage, it instead deals only its reliable damage (2), even on hit."
    },
    "description": "Speaker 2 (M.A2.SP2) [Audio, length: 120:36][34% corruption][Dated 18593U, 01:50] [UIB-TERMAGANTTANGENT ROYAL]<br>“Dark. Wet. Drink deep, and descend. The water is warm and well. It is very busy here, though you cannot see it. The swimmers are curious. Open your mouth.”",
    "data_type": "weapon",
    "aptitude": {}
  },
  {
    "id": "mw_warp_rifle",
    "name": "WARP RIFLE",
    "mount": "Main",
    "type": "Rifle",
    "damage": [
      {
        "type": "energy",
        "val": "1d3+1"
      }
    ],
    "range": [
      {
        "type": "Range",
        "val": 10
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_ap"
      },
      {
        "id": "tg_loading"
      }
    ],
    "source": "HA",
    "license": "SUNZI",
    "license_level": 2,
    "effect": {
      "effect_type": "Offensive",
      "hit": "The target must pass an engineering save or be teleported to a free valid space in a direction of your choice up to the same number of spaces as the damage you dealt with this weapon (including bonus damage, etc, maximum 10 spaces)."
    },
    "description": "Es una abominación. Dicen que \"es como los arados de las espadas; tú también debes aprender a defender tu hogar ”. Ptah, escupí su lógica de espada. Ni siquiera sabíamos de los arados compartidos antes de convertirlos en espadas, y éramos felices.<br>Hiciste la puerta, la abriste. No es nuestra responsabilidad cerrarla.<br>[It is an abomination. They say “it is like plowshares to swords; you too must learn to defend your home.” Ptah, I spit on their blade-law. We did not even know of plowshares before they beat them into swords, and we were happy.<br>You made the door, you swung it open — it is not our responsibility to close it.]",
    "data_type": "weapon",
    "aptitude": {},
    "sp": 1
  },
  {
    "id": "mw_xiaoli_combat_sheathe",
    "name": "XIAOLI COMBAT SHEATHE",
    "mount": "Main",
    "type": "Melee",
    "damage": [
      {
        "type": "kinetic",
        "val": "1d3+2"
      }
    ],
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "tags": [],
    "source": "IPS-N",
    "license": "ZHENG",
    "license_level": 1,
    "effect": {
      "effect_type": "Offensive",
      "attack": "You may attack one or two targets in threat. You may use this weapon even while jammed."
    },
    "description": "This enhancement encases a mech’s manipulators and brachial structures in a powerful reactive alloy weave, allowing it to use its fists as blunt weapons, even unarmed.",
    "data_type": "weapon",
    "aptitude": {}
  },
  {
    "id": "mw_d_d_288",
    "name": "D/D 288",
    "mount": "Superheavy",
    "type": "Melee",
    "damage": [
      {
        "type": "kinetic",
        "val": "1d6"
      }
    ],
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "tags": [
      {
        "id": "tg_reliable",
        "val": 3
      }
    ],
    "source": "IPS-N",
    "license": "ZHENG",
    "license_level": 3,
    "effect": {
      "effect_type": "Offensive",
      "detail": "This weapon can be used with the above profile to Skirmish.<br>As a quick action, you may charge this weapon. While charged, your mech is slowed, you take 2 heat at the start of your turn, and benefit from soft cover. At the start of any of your turns in which your weapon is charged, the weapon gains the Charged profile.",
      "abilities": [{
        "effect_type": "Profile",
        "name": "Charged",
        "damage": [{
          "type": "explosive",
          "val": "4d6+8"
        }],
        "range": [{
          "type": "Threat",
          "val": 3
        }],
        "detail": "While charged, this weapon deals 30 AP explosive damage to objects or terrain on hit. If an object or piece of terrain struck by this weapon is destroyed, it explodes, dealing 1d6 kinetic damage to all adjacent characters other than you and knocking them back 1 space.<br>After hitting with this weapon, you lose this charging state. You can also stop charging as a free action, and you also lose the charge if you are stunned or shut down.",
        "tags": [{
          "id": "tg_reliable",
          "val": 8
        }, {
          "id": "tg_knockback",
          "val": 8
        }]
      }]
    },
    "description": "The Xiaoli devastator/demolition weapon is legendary for its ability to breach and inflict total destruction on hardened targets. Originally rigged as a last resort by it’s operator, this fist-mounted weapon is essentially a redirection of the mechs’ core reactor. It must be primed before firing, requiring a dangerous power draw from the mechs’ systems and creating an enormous amount of emissions. The weapons’ first firing killed Xiong Xiaoli and five of her opponents, and its tendency to cause enormous collateral damage and its spectacular discharge when fired earned it the moniker ‘Shā mǎ zhǎng’ or Horse Killing Palm.",
    "data_type": "weapon",
    "aptitude": {}
  },
  {
    "id": "mw_caliban_integrated",
    "name": "HHS-075 “Flayer” Shotgun",
    "mount": "Main",
    "type": "CQB",
    "range": [
      {
        "type": "Range",
        "val": 3
      },
      {
        "type": "Threat",
        "val": 3
      }
    ],
    "damage": [
      {
        "type": "kinetic",
        "val": "1d6+1"
      }
    ],
    "effect": {
      "effect_type": "Offensive",
      "attack": "When the Caliban fires the flayer shotgun as part of any action, it can use the butt end to smack an adjacent character after the action resolves, dealing that character 1 kinetic damage and knocking them back 1 space."
    },
    "description": "",
    "tags": [
      {
        "id": "tg_inaccurate"
      },
      {
        "id": "tg_knockback",
        "val": 2
      }
    ]
  }
]